Update: Updated Readme and Readme.ru files
